tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "isacikgoz/taps"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "miniscruff/changie", "https://github.com/miniscruff/changie"
tap "miniscruff/envexample", "https://github.com/miniscruff/envexample"
tap "ms-jpq/sad"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "python@3.12"
brew "python@3.11"
brew "awscli"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "broot"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "d2"
brew "delve"
brew "docker", link: false
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "go"
brew "golangci-lint"
brew "gping"
brew "grc"
brew "hurl"
brew "jq"
brew "kubernetes-cli", link: false
brew "libpq"
brew "localstack"
brew "lua"
brew "neofetch"
brew "neovim"
brew "openapi-generator"
brew "pipx"
brew "pngpaste"
brew "procs"
brew "pyenv"
brew "python@3.10"
brew "ranger"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "starship"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "isacikgoz/taps/tldr"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "localstack/tap/localstack-cli", link: false
brew "miniscruff/changie/changie"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "qmk/qmk/qmk"
cask "firefox"
cask "font-noto-color-emoji"
cask "qmk-toolbox"
cask "sf-symbols"
cask "wezterm"
