tap "1password/tap"
tap "ankitpokhrel/jira-cli"
tap "felixkratz/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "isacikgoz/taps"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "miniscruff/changie", "https://github.com/miniscruff/changie"
tap "miniscruff/envexample", "https://github.com/miniscruff/envexample"
tap "ms-jpq/sad"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "ast-grep"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "awscli"
brew "libgit2"
brew "bat"
brew "bat-extras"
brew "broot"
brew "btop"
brew "d2"
brew "delve"
brew "docker", link: false
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libarchive"
brew "libmicrohttpd"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gitbatch"
brew "go"
brew "gping"
brew "grc"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli", link: false
brew "libpq"
brew "localstack"
brew "lua"
brew "neofetch"
brew "neovim"
brew "nowplaying-cli"
brew "nvm"
brew "openapi-generator"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "postgresql@14"
brew "procs"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "ranger"
brew "rcm"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "sevenzip"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "yazi"
brew "zoxide"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "heroku/brew/heroku"
brew "isacikgoz/taps/tldr"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "localstack/tap/localstack-cli", link: false
brew "miniscruff/changie/changie"
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "qmk/qmk/qmk"
cask "1password-cli"
cask "aerospace"
cask "alfred"
cask "docker"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-monaspace"
cask "font-noto-color-emoji"
cask "font-symbols-only-nerd-font"
cask "postman"
cask "qmk-toolbox"
cask "sf-symbols"
cask "wezterm@nightly"
