# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------
tap "1password/tap"
tap "ankitpokhrel/jira-cli"
tap "atlassian/acli"
tap "felixkratz/formulae"
tap "heroku/brew"
tap "isacikgoz/taps"
tap "koekeishiya/formulae"
tap "miniscruff/envexample", "https://github.com/miniscruff/envexample"
tap "ms-jpq/sad"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# ---------------------------------------------------------------------------
# Core / Libraries
# ---------------------------------------------------------------------------
brew "bash"
brew "zsh"
brew "libpng"
brew "freetype"
brew "cairo"
brew "jpeg"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "libffi"
brew "libgit2"
brew "libpq"
brew "librist"
brew "libmicrohttpd"
brew "zlib"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "tesseract"

# ---------------------------------------------------------------------------
# CLI Tools
# ---------------------------------------------------------------------------
brew "ast-grep"
brew "broot"
brew "btop"
brew "d2"
brew "ffmpeg"
brew "gping"
brew "grc"
brew "imagemagick"
brew "neofetch"
brew "nowplaying-cli"
brew "parallel"
brew "pngpaste"
brew "pngquant"
brew "poppler"
brew "procs"
brew "rcm"
brew "rm-improved"
brew "sevenzip"
brew "switchaudio-osx"
brew "yq"
brew "zellij"

# ---------------------------------------------------------------------------
# Git
# ---------------------------------------------------------------------------
brew "git-delta"
brew "git-lfs"
brew "gitbatch"

# ---------------------------------------------------------------------------
# Languages & Runtimes
# ---------------------------------------------------------------------------
brew "fnm"
brew "lua"
brew "mise"
brew "nvm"
brew "rust"
brew "delve"

# ---------------------------------------------------------------------------
# Databases
# ---------------------------------------------------------------------------
brew "postgresql"

# ---------------------------------------------------------------------------
# Docker & Kubernetes
# ---------------------------------------------------------------------------
brew "docker", link: false
brew "docker-credential-helper"
brew "kubernetes-cli", link: false

# ---------------------------------------------------------------------------
# API & Code Generation
# ---------------------------------------------------------------------------
brew "openapi-generator"

# ---------------------------------------------------------------------------
# Zsh Plugins
# ---------------------------------------------------------------------------
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# ---------------------------------------------------------------------------
# Window Management & Bar
# ---------------------------------------------------------------------------
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# ---------------------------------------------------------------------------
# Third-party CLIs
# ---------------------------------------------------------------------------
brew "ankitpokhrel/jira-cli/jira-cli"
brew "atlassian/acli/acli"
brew "heroku/brew/heroku"
brew "isacikgoz/taps/tldr"

# ---------------------------------------------------------------------------
# QMK / Embedded
# ---------------------------------------------------------------------------
brew "osx-cross/arm/arm-gcc-bin@10"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "qmk/qmk/qmk"

# ---------------------------------------------------------------------------
# Casks
# ---------------------------------------------------------------------------
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "alfred"
cask "docker-desktop"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-monaspace"
cask "font-noto-color-emoji"
cask "font-symbols-only-nerd-font"
cask "postman"
cask "qmk-toolbox"
cask "sf-symbols"
cask "ghostty"

# ---------------------------------------------------------------------------
# Go packages
# ---------------------------------------------------------------------------
go "github.com/air-verse/air"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/miniscruff/envexample"
go "github.com/daixiang0/gci"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/princjef/gomarkdoc/cmd/gomarkdoc"
go "github.com/charmbracelet/gum"
go "github.com/swaggo/swag/cmd/swag"
